package com.btbms.pages.enums;

public enum LiabilityAndResponsibleType {
    T01("01 - 生控A組"),
    T02("02 - 生控B組"),
    T03("03 - 生控C組"),
    T04("04 - 生控D組"),
    T05("05 - 生控E組"),
    T06("06 - 生控F組"),
    T07("07 - 生控G組"),
    T08("08 - 生控H組"),
    T09("09 - 生控M組"),
    T10("10 - 生控Q組"),
    T11("11 - 生控W組"),
    T12("12 - 生控X組"),
    T13("13 - 生控Y組"),
    T15("15 - 中央計劃CPO組"),
    T16("16 - 中央計劃織廠組"),
    T17("17 - 中央計劃染廠組"),
    T18("18 - 中央計劃整理組"),
    T20("20 - 針織廠"),
    T21("21 - 外協廠"),
    T22("22 - 緯編原料"),
    T23("23 - 經編原料"),
    T25("25 - 經編廠"),
    T26("26 - 染A廠"),
    T27("27 - 染B廠"),
    T28("28 - 染C廠"),
    T29("29 - 染D廠"),
    T30("30 - 染E廠"),
    T31("31 - 染F廠"),
    T32("32 - 染生產部"),
    T33("33 - 染廠備布組"),
    T34("34 - 染紗廠"),
    T35("35 - 染廠技術部"),
    T36("36 - 生產技術部化室"),
    T37("37 - 染料問題"),
    T39("39 - 整A廠"),
    T40("40 - 整B廠"),
    T41("41 - 整C廠"),
    T42("42 - 整D廠"),
    T43("43 - 整E廠"),
    T44("44 - 整F廠"),
    T45("45 - 整G廠"),
    T46("46 - 整H廠"),
    T47("47 - 整生產部"),
    T48("48 - 整理技術部"),
    T50("50 - 印花廠"),
    T51("51 - 公司QM部"),
    T52("52 - 胚紗倉"),
    T53("53 - 胚布倉"),
    T54("54 - 成品倉"),
    T56("56 - 船務部"),
    T57("57 - 中央倉"),
    T58("58 - 報關組"),
    T59("59 - 工程部"),
    T60("60 - 水廠"),
    T61("61 - 熱電廠"),
    T62("62 - 原因待查"),
    ;
    private final String value;

    public String getValue() {
        return this.value;
    }

    LiabilityAndResponsibleType(String levelCode) {
        this.value = levelCode;
    }
}
